In [45]:
# continue data dummification from dummification 1
# Import basic necessities
import pandas as pd
import numpy as np
import os

import warnings
warnings.filterwarnings('ignore')

In [46]:
# Make dummies - total 60, let's reduce to most owned vehicles
vehicles_file = "data/vehicles.csv"
drivers_file = "data/drivers.csv"
keep_vehicle_file = "data/vehicle_keep.csv"

In [47]:
# Get Initial Data
dr_df =pd.read_csv(drivers_file)
veh_df =pd.read_csv(vehicles_file)
kp_df = pd.read_csv(keep_vehicle_file)

In [48]:
dr_df.info

<bound method DataFrame.info of          DRIVER_ID  GENDER  CREDIT_SCORE  VEHICLE_ID  AGE
0                1       2           824     7399455   32
1                2       2           824     6078430   88
2                3       2           750     6212210   34
3                4       2           750     7416184   22
4                5       2           824     6078430   88
...            ...     ...           ...         ...  ...
1048570    1053422       1           666     6440644   73
1048571    1053423       1           627     6592469   38
1048572    1053424       1           847     7182224   55
1048573    1053425       1           847     6112997   26
1048574    1053426       1           811     6801782   50

[1048575 rows x 5 columns]>

In [49]:
kp_df.count # total 8838 cars

<bound method DataFrame.count of       VEHICLE_ID  YEAR    MAKE  MODEL  TOTAL_COUNT  KEEP
0        4044358  2011  NISSAN  ROGUE         2138  True
1        4044361  2013  NISSAN  ROGUE         2138  True
2        4044377  2012  NISSAN  ROGUE         2138  True
3        7266697  2010  NISSAN  ROGUE         2138  True
4        7266698  2011  NISSAN  ROGUE         2138  True
...          ...   ...     ...    ...          ...   ...
8833     7468364  2019     KIA   SOUL         3986  True
8834     7468368  2019     KIA   SOUL         3986  True
8835     7468416  2015     KIA   SOUL         3986  True
8836     7468434  2019     KIA   SOUL         3986  True
8837     7468462  2018     KIA   SOUL         3986  True

[8838 rows x 6 columns]>

In [50]:
new_data_df = dr_df.merge(kp_df, left_on='VEHICLE_ID', right_on='VEHICLE_ID')

In [51]:
print(new_data_df['MAKE'].unique()) # 16 Make left
c_u = new_data_df['MODEL'].unique() # 126 Model left
print(c_u.size)

['DODGE' 'CHRYSLER' 'FORD' 'CHEVROLET' 'HYUNDAI' 'NISSAN' 'RAM' 'JEEP'
 'HONDA' 'TOYOTA' 'BUICK' 'KIA' 'GMC' 'LEXUS' 'LINCOLN' 'MERCEDES-BENZ']
126

In [52]:
# Gernerate final data for model
new_data_df.head()

,DRIVER_ID,GENDER,CREDIT_SCORE,VEHICLE_ID,AGE,YEAR,MAKE,MODEL,TOTAL_COUNT,KEEP
0,1,2,824,7399455,32,2016,DODGE,JOURNEY SXT,1854,True
1,2181,2,824,7399455,29,2016,DODGE,JOURNEY SXT,1854,True
2,38154,2,631,7399455,28,2016,DODGE,JOURNEY SXT,1854,True
3,38265,2,666,7399455,28,2016,DODGE,JOURNEY SXT,1854,True
4,47115,2,671,7399455,39,2016,DODGE,JOURNEY SXT,1854,True

In [53]:
new_data_df['GENDER'].unique()
new_data_df.loc[new_data_df.GENDER ==2, 'GENDER'] = 0

In [54]:
new_data_df['GENDER'].unique()

array([0, 1], dtype=int64)

In [55]:
new_data_df.head()

,DRIVER_ID,GENDER,CREDIT_SCORE,VEHICLE_ID,AGE,YEAR,MAKE,MODEL,TOTAL_COUNT,KEEP
0,1,0,824,7399455,32,2016,DODGE,JOURNEY SXT,1854,True
1,2181,0,824,7399455,29,2016,DODGE,JOURNEY SXT,1854,True
2,38154,0,631,7399455,28,2016,DODGE,JOURNEY SXT,1854,True
3,38265,0,666,7399455,28,2016,DODGE,JOURNEY SXT,1854,True
4,47115,0,671,7399455,39,2016,DODGE,JOURNEY SXT,1854,True

In [56]:
columns = ['DRIVER_ID', 'VEHICLE_ID','TOTAL_COUNT', 'KEEP']
new_data_df.drop(columns, inplace=True, axis=1)

In [58]:
new_data_df.head()

   GENDER  CREDIT_SCORE  AGE  YEAR   MAKE        MODEL
0       0           824   32  2016  DODGE  JOURNEY SXT
1       0           824   29  2016  DODGE  JOURNEY SXT
2       0           631   28  2016  DODGE  JOURNEY SXT
3       0           666   28  2016  DODGE  JOURNEY SXT
4       0           671   39  2016  DODGE  JOURNEY SXT

In [59]:
new_data_df.to_csv("data/driver_vehicle.csv", index=False)